Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་དེ་ཁོ་ནས་སྐྱོ་བར་གྱུར་ནས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: After this alone fills him with deep sadness about saṃsāra, he will pass beyond all sorrow into the realm of nirvāṇa without any remainder of the aggregates.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་གི་ཡིད་སྐྱོ་བར་གྱུར་པར་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended their grief, taught them the Dharma accordingly,

source: དེས་ན་འཁོར་དེ་དག་གི་ནང་ནས་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: and among the assembled some generated heat right where they sat.

source: ཁ་ཅིག་གིས་ནི་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་བ་དང་། །
en: some to become great universal monarchs,

source: འཁོར་དེ་དག་གི་ནང་ནས་ཕལ་ཆེར་ནི་སངས་རྒྱས་ལ་གཞོལ། ཆོས་ལ་འབབ་དགེ་འདུན་ལ་བབ་པར་བྱས་ཏེ་བཀོད་དོ།། །།
en: Among the assembled, most found themselves drawn to the Buddha, intent on the Dharma, and favoring the Saṅgha.

source: ཁམ་ཞེས་བྱ་བ་ནི།
en: Morsel

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Once, when the Blessed One was in Śrāvastī, he said to the monks,

source: དགེ་སློང་དག་གལ་ཏེ་ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ། སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་པ་བཞིན་དུ། སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ། སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་སུ་ཟིན་ན་ནི། དེ་ལྟ་ན་ཁམ་གྱི་ཐ་མ་དང་ཁམ་གྱི་མཇུག་ལུས་པ་གང་ཡིན་པ་དེ་ལས་ཀྱང་། གལ་ཏེ་ཡོན་གནས་ལེན་པ་པོ་རྙེད་ན་དེ་ལ་མ་བྱིན་ནམ་བགོ་བཤའ་མ་བྱས་ཀྱི་བར་དུ་ཟ་བར་མི་བྱེད་ལ།
en: “Monks, if all beings came to understand the fruits of giving and the karmic ripening of the fruits of each portion given just as I understand the fruits of giving and know the karmic ripening of the fruits of each portion given, then those who received offerings would not eat even the tiniest remnant of a single morsel unless they had given of it or portioned it out.

source: དེ་དག་གི་སེམས་ཀྱང་སེར་སྣ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཤིང་འདུག་པར་མི་འགྱུར་བ་ཞིག་ན། ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་ཡང་ཤེས་ལ། སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་ཤེས་པ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱིས་སྦྱིན་པའི་འབྲས་བུ་ཡང་མི་ཤེས་ལ། སྦྱིན་པའི་བགོ་བཤའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་མི་ཤེས་པས་ན།
en: “If beings’ minds do not change but rather remain ensnared by miserliness, they do not understand the fruits of giving or know the karmic ripening of the fruits of each portion given the way that I understand the fruits of giving and know the karmic ripening of the fruits of each portion given.

source: དེའི་ཕྱིར་དེ་དག་ནི་ཀུན་ཏུ་འཛིན་པའི་སེམས་ཀྱིས་མ་བྱིན་པའམ། བགོ་བཤའ་མ་བྱས་པར་ཟ་བར་བྱེད་ལ་དེ་དག་གི་སེམས་ཀྱང་སེར་སྣ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཤིང་འདུག་གོ །
en: That is why their minds clutch at everything, they fail to give, they eat without sharing any portion, and their minds are ensnared by miserliness.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ཏེ།
en: Thus spoke the Blessed One.

source: བདེ་བར་གཤེགས་པས་དེ་སྐད་གསུངས་ནས། གཞན་ཡང་སྟོན་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: After the Sugata had said such, he, our Founder, continued:

source: བགོ་བཤའ་དག་གི་རྣམ་པར་སྨིན། །ཇི་ལྟར་དོན་ཆེན་འགྱུར་བ་དེ། །དྲང་སྲོང་ཆེ་རྣམས་གསུངས་པ་བཞིན། །སེམས་ཅན་རྣམས་ཀྱིས་ཤེས་ན་ནི། །
en: “If sentient beings only knew What it is the sages teach— The ripening of each portion given And just how great it will become—

source: མ་བྱིན་བར་དུ་མི་ཟ་ཞིང་། །སེར་སྣ་ཅན་དུ་མི་འགྱུར་ལ། །
en: “Then their minds would not be filled with greed; And not having shared, they would not eat;

source: དེ་དག་ཀུན་ཏུ་འཛིན་པའི་སེམས། །ནམ་ཡང་སྐྱེ་བར་མི་འགྱུར་ན
en: And the grasping that pervades their minds Would never appear again.

source: གང་ཕྱིར་བྱིས་པ་གཏི་མུག་གིས། །བསྒྲིབས་པ་ཀུན་གྱིས་མ་ཤེས་པས། །དེ་ཕྱིར་ཀུན་དུ་འཛིན་སེམས་ཀྱིས། །
en: “Unaware, the naive are veiled In darkness, and so they grasp at Everything.

source: རྟག་ཏུ་མ་བྱིན་ཟ་བར་བྱེད། །དེ་དག་སེར་སྣ་སྐྱེས་ནས་ཀྱང་། །སེམས་ནི་ཀུན་ནས་དཀྲིས་ཤིང་འདུག །
en: They never think To share, though they eat and eat. Thus their greed, born of mind, Keeps them bound.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་གཟིགས་ལགས།
en: “Lord,” the monks requested of the Blessed One,

source: བཅོམ་ལྡན་འདས་ནི་སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའི་བསྔགས་པ་གསུང་བ་ལགས་སོ། །
en: “tell us why the Blessed One has spoken in praise of giving and of the portion given.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེའདས་པའི་དུས་ན་ཡང་ང་ཇི་ལྟར་སྦྱིན་པ་དང་། སྦྱིན་པའི་བགོ་བཤའི་བསྔགས་པ་བརྗོད་པར་གྱུར་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I commended giving and of the portion given. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་ཟླ་འོད་ཅེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times past King Candraprabha reigned in the city of Vārāṇasī.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་དང་ཆོམ་རྐུན་དང་ནད་དང་མུ་གེ་མེད་པ་དང་འབྲས་སཱ་ལུ་དང་བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: His kingdom was prosperous, flourishing, happy, and well populated. The harvest was good. Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful.

source: གནོད་པ་མེད་ཅིང་ཚེར་མ་དཀྲུགས་ལ། བུ་གཅིག་པ་སྡུག་པ་ལ་བྱ་བ་བཞིན་དུ་ཆོས་བཞིན་དུ་རྒྱལ་སྲིད་བྱེད་དོ། །
en: His was a reign in accord with the Dharma. He ruled the kingdom gently and mercifully, as a parent cares for a beloved only child.

source: རྒྱལ་པོ་དེ་ཡང་བྱམས་པའི་བདག་ཉིད་ཅན་སྙིང་རྗེ་དང་ལྡན་པ། སེམས་ཅན་ལ་བྱམས་པ་སྦྱིན་པ་ལ་དགའ་བ་ཞིག་གོ། །
en: “This king’s nature was loving and compassionate, with a love for beings and a delight in giving.

source: དེ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱེད་དེ།
en: He gave gifts and made merit.

source: དེ་ཟས་འདོད་པ་རྣམས་ལ་ནི་ཟས་སྦྱིན་པར་བྱེད།
en: To those who wished for food he gave food.

source: སྐོམ་འདོད་པ་རྣམས་ལ་ནི་སྐོམ་སྦྱིན་པར་བྱེད།
en: To those who wished for something to drink he gave something to drink.

source: གོས་འདོད་པ་རྣམས་ལ་ནི་གོས་སྦྱིན་པར་བྱེད།
en: To those who wished for clothes he gave clothes.

source: སྤོས་དང་མེ་ཏོག་ཕྲེང་དང་བྱུག་པ་འདོད་པ་རྣམས་ལ་ནི་སྤོས་དང་མེ་ཏོག་ཕྲེང་དང་བྱུག་པ་རྣམས་སྦྱིན་པར་བྱེད་དོ། །
en: To those who wished for incense, flower garlands, and fragrant ointments he gave incense, flower garlands, and fragrant ointments.

source: ནད་པ་ལ་མཁོ་བའི་ནད་བྲང་བཅས་ནས་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ཏེ།
en: To the sick and to the homes for the sick he provided everything that was needed.

source: སྐྱེ་བོ་དམན་པ་དང་བཀྲེན་པ་དང་སྡུག་པ་དང་མགོན་མེད་པ་རྣམས་ལ་རིམ་གྲོ་བྱེད་དོ། །
en: He served the lowly, the hungry, the poor, and the orphaned.

source: བཟའ་བ་དང་བཅའ་བ་མང་པོ་སྟ་གོན་བྱས་ནས། ནམ་མཁའ་ལ་རྒྱུ་བ་རྣམས་དང་ཆུ་ན་གནས་པ་རྣམས་དང་ཐང་ལ་གནས་པ་རྣམས་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: He prepared a great deal of food and drink and made gifts of it to the creatures who flew through the sky, dwelt in the water, or made their homes in the fields.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཀཱ་ཤིའི་ཡུལ་དུ་ཐན་པ་བྱུང་སྟེ།
en: “One day a drought befell Kāśi.

source: དེར་ལྟས་མཁན་བྲམ་ཟེ་བྱེ་བྲག་ཕྱེད་པ་རྣམས་ཀྱིས་བསྒོ་བ། ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཆར་འབབ་པར་མི་འགྱུར་རོ་ཞེས་ཟེར་རོ། །
en: The brahmin augurs read the portents and announced that for twelve years there would be no rain.

source: དེ་ནས་ཆར་མ་བབ་པས་མུ་གེ་བྱུང་སྟེ། སྐྱེ་བོ་མང་པོ་དེ་དག་ཅི་བྱ་གཏོལ་མེད་པར་གྱུར་ཏོ། །
en: Because no rain fell, a famine broke out, and people became uncertain what to do.

source: དེ་ནས་རྒྱལ་པོ་ཟླ་འོད་ཀྱིས་དྲིལ་བསྒྲགས་ཏེ།
en: “King Candraprabha made a proclamation:

source: ཁྱེད་ཀྱི་ནང་ན་ལོ་བཅུ་གཉིས་ཀྱི་ཟན་འབྱོར་པ་གང་ཡིན་པ་དེ་དག་ནི་འདི་ཉིད་དུ་འཁོད་ཅིག །
en: ‘Let those among you remain here who have food enough for twelve years.

source: མི་འབྱོར་པ་དེ་དག་ནི་ཡུལ་གཞན་དུ་དེང་ལ། ནམ་ལོ་ལེགས་པར་གྱུར་པ་དེའི་ཚེ་ཕྱིར་ཤོག་ཅིག །
en: Let those who are without travel to another land, and return when harvests are good.

source: ཡུལ་ནི་ཕྱིས་ཀྱང་ཡོད་ལ། སྲོག་ནི་ཕྱིས་མེད་དོ་ཞེས་བསྒོའོ། །
en: For to your country you may return, but to this life you cannot.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་མང་པོ་དེ་དག་ལས་ཁ་ཅིག་ནི་ཡུལ་གཞན་དུ་དོང་སྟེ་འཁོད་དོ། །
en: “No sooner did they hear this than some among the assembled traveled to other lands and settled there.

source: ཁ་ཅིག་ནི་ཡུལ་ལ་ཆགས་ནས་དེ་ཉིད་ན་འཁོད་དེ།
en: Others, attached to their homeland, simply remained.

source: དེ་དག་དེ་ན་སུ་ལ་ཟན་ཇི་ཙམ་ཡོད་པ་དེ་དག་ཟོས་པའི་འོག་ཏུ་བཀྲེས་པས་ཉམ་ཐག་ནས་རྒྱལ་པོའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: When those of them with food had consumed it all and were sick with hunger, they approached the king and said, ‘Deva, we are famished.

source: ལྷ་བདག་ཅག་ནི་བཀྲེས་ལགས་ཀྱིས་བདག་ཅག་ལ་འཚལ་མ་སྩལ་དུ་གསོལ།
en: Please, give us something to sustain us.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེས་བསམས་པ།
en: “When he heard this, right away the king thought,

source: འདིར་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཡུན་རིང་པོ་ཞིག་ཏུ་བགོ་བཤའ་བྱ་དགོས་སྙམ་ནས་ སྨྲས་པ།
en: ‘All of these people need provisioning that will last for a long time.’ With this thought, he said,

source: ཁྱེད་རེ་ཞིག་སྡོད་ཅིག་དང་ངས་མངན་རྣམས་ལ་སྨྲས་ཏེ་
en: ‘Wait here awhile, all of you, while I speak to the grain keepers.

source: བྱའོ་ཞེས་བྱས་ནས
en: Then I shall take action.’

source: རྒྱལ་པོ་དེས་མངན་རྣམས་ལ་སྨྲས་པ། ང་དང་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་འདི་དག་གིས་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་བཟར་ཡོད་དམ།
en: “ ‘Do we have enough food for me and all those who remain in the country to last for twelve years?’ he asked.

source: མངན་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་སྩང་བང་རྣམས་གཡར་སྔར་བྲིམས་ཏེ་གདོད་གསོལ་བར་འཚལ་ལོ་ཞེས་སྨྲས་ནས
en: “ ‘Deva, let us take an account of the granaries and make allocations,’ the grain keepers replied.

source: མངན་རྣམས་ཀྱིས་སྩང་བང་རྣམས་གཡར་སྔར་བྲིམས་ནས། ཡུལ་ན་འཁོད་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་བགྲང་བ་ལ་ཞུགས་སོ། །
en: “The grain keepers examined the granaries and made allocations, and then began to tally the people remaining in the country.

source: དེ་ནས་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་མི་རེ་རེའི་སྐལ་བར་ཅི་ཐོབ་པ་རྩིས་ན། ཐམས་ཅད་ཀྱིས་ཉིན་གཅིག་བཞིན་དུ་ཁམ་རེ་རེ་ཐོབ་པར་འགྱུར་ལ། རྒྱལ་པོས་ནི་ཁམ་གཉིས་གཉིས་གསོལ་དུ་ཡོད་པར་རིག་ནས།
en: Then they calculated the shares to be distributed over twelve years, reckoning that every day, each person could receive a single morsel, and the king, two.

source: དེ་དག་གིས་རྒྱལ་པོ་ལ་གསོལ་པ། ལྷ་དགུང་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱིས་ནི་གདུགས་གཅིག་བཞིན་དུ་ཁམ་རེ་རེ་འཚལ་དུ་མཆིས་སོ། །
en: “They said to the king, ‘Deva, for twelve years each of the country’s inhabitants can receive a single morsel per day,

source: ལྷས་ནི་ཞལ་ཁམ་གཉིས་གཉིས་གསོལ་དུ་མཆིས་སོ་ཞེས་གསོལ་ཏོ། །
en: and your share, Deva, will be two.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེས་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཉིན་གཅིག་ཅིང་ཁམ་རེ་རེ་སྦྱིན་ནོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: “As soon as the king heard this, he announced, ‘Every day one morsel will be distributed to each person living in the country.’

source: སྐྱེ་བོ་མང་པོ་དེ་དག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་འཛུད་དོ། །
en: All the people upheld the virtuous path, and thereafter,

source: དེ་ནས་དེར་སུ་ཡང་རུང་འཆི་བར་འགྱུར་བ་དེ་དག་ཀྱང་ལྷའི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: all who died there took birth among the gods.

source: དེ་དག་དེར་སྐྱེས་པས་ལྷའི་གནས་རྣམས་ཀུན་ཏུ་གང་བར་གྱུར་ཏོ། །
en: As they were born there, they began to fill all the gods’ residences.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: “Then Śakra, King of the Gods, thought,

source: ལྷའི་གནས་རྣམས་ནི་རྒྱུ་གཉིས་ཀྱིས་ཀུན་དུ་གང་བར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་འཁོར་ལོས་སྒྱུར་བ་འབྱུང་བ་ཡིན་ན།
en: ‘There are but two reasons that the gods’ residences fill up—the appearance of a tathāgata, or the appearance of a universal monarch.

source: ཅི་ད་ལྟར་འཇིག་རྟེན་དུ་འཁོར་ལོས་སྒྱུར་བ་བྱུང་ངམ། འོན་ཏེ་དེ་བཞིན་གཤེགས་པ་བྱུང་ཞིག་གུ་སྙམ་དུ་བསམས་ནས།
en: Has then a universal monarch now appeared in the world, or has a tathāgata appeared?’

source: དེས་བལྟས་ན་དེ་ལྟ་མ་ཡིན་ཏེ།
en: But when he looked, he saw that it was not so.

source: ཡང་དེས་བསམས་པ་འོ་ན་སུའི་མཐུས་ལྷའི་གནས་རྣམས་ཀུན་ཏུ་གང་བར་གྱུར་ཞིག་གུ་སྙམ་སྟེ།
en: Again he wondered, ‘Well then, because of whom have the gods’ residences become full?’

source: དེས་བལྟས་ནས་རྒྱལ་པོ་ཟླ་འོད་ཀྱི་མཐུས་དེ་ལྟར་གྱུར་པར་རིག་ནས། དེས་བསམས་པ།
en: “Then he looked, realized that it was because of King Candraprabha, and thought, ‘What—is he to become like Śakra, or perhaps Brahmā?’

source: ཅི་འདི་བརྒྱ་བྱིན་དུ་འགྱུར་བའམ་ཚངས་པར་འགྱུར་བ་ཞིག་བསྒྲུབ་སྙམ་དུ་བསམས་ཏེ། དེས་བལྟས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་མཐོང་ངོ་། །
en: When he looked, he saw that King Candraprabha was practicing to attain unexcelled, total, and complete enlightenment.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཅི་སེམས་ཅན་འདི་བརྟན་པོ་ཡིན་ནམ། འོན་ཏེ་སེམས་ཅན་བརྟན་པོ་མ་ཡིན་པ་རེ་ཞིག་བདག་སོང་ལ་འདི་བརྟག་པར་བྱའོ། །
en: So Śakra, King of the Gods, said, ‘I will go for a time and see for myself whether he is of firm resolve.

source: གལ་ཏེ་སེམས་ཅན་བརྟན་པོ་ཡིན་ན་ནི་དེ་ལ་མཆོད་པ་བྱའོ། །
en: If this being’s resolve is firm, I shall worship him.

source: དེ་སྟེ་སེམས་ཅན་བརྟན་པོ་མ་ཡིན་ན་ནི་དེ་བརྟན་པོར་བྱའོ། །
en: If his resolve is not firm, I shall steady him.’

source: སྙམ་ནས་བྲམ་ཟེའི་ཆ་ལུགས་སུ་བསྒྱུར་ཏེ། ལྷ་བདག་ནི་བཀྲེས་ཀྱིས་འཚལ་མ་སྩལ་དུ་གསོལ་ཅེས་སྨྲས་སོ། །
en: With this in mind, he transformed his appearance into that of a brahmin and said, ‘Deva, I am famished. Please, give me something to sustain me.’

source: རྒྱལ་པོས་བསམས་པ། གལ་ཏེ་གཞན་གྱི་བཅད་དེ་འདི་ལ་བྱིན་ན་ནི་གཅིག་གི་སྲོག་སྲུངས་ལ་གཅིག་གི་སྲོག་མ་རུངས་པར་བྱས་པར་འགྱུར་གྱིས།
en: “ ‘If I cut off someone else and give to him,’ the king thought, ‘I’ll be taking one life to protect another,

source: མ་ལ་བདག་གི་ཟན་ལས་ཁམ་གཅིག་ནི་བདག་གིས་ཟོས་ལ། ཁམ་གཅིག་ནི་འདི་ལ་སྦྱིན་ནོ་སྙམ་ནས་
en: so I will eat just one morsel of food, and give the other to him!’

source: རྒྱལ་པོ་དེས་བྲམ་ཟེ་དེ་ལ་ཁམ་གཅིག་བྱིན་ཏེགཅིག་བདག་གིས་བཟའོ་སྙམ་པ་དང་།
en: The king handed the morsel to the brahmin, but just as he thought,

source: བྲམ་ཟེ་དེས་སྨྲས་པ། ལྷ་བདག་ནི་ཁམ་གཅིག་གིས་འཚོ་བའི་རྔོ་མི་ཐོགས་སོ། །
en: ‘Now I will eat the other,’ the brahmin said, ‘Deva, I can’t survive on just one morsel.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དེས་བསམས་པ་གལ་ཏེ་བདག་གིས་འདི་ལ་ཁམ་ཕྱི་མ་མ་བྱིན་ན་བྲམ་ཟེ་འདི་ལྟོགས་ཏེ།
en: Right away the king thought, ‘If I don’t give the second morsel to this brahmin, he will starve.

source: འཆི་ཡང་སྲིད་ལ་བདག་ཀྱང་སེམས་ཅན་གྱི་དོན་ལ་ཞུགས་པ་ཡིན་པས་བདག་གིས་རང་གི་སྲོག་བོར་ཏེ། གཞན་གྱི་སྲོག་བསྲུང་བར་ནུས་སོ་སྙམ་ནས་
en: He might even die. Since I am committed to the welfare of beings, I’m capable of protecting the life of another even at the cost of my own.’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ།
en: So he prayed for unexcelled, total, and complete enlightenment, saying,

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་ཅིང་ཡོངས་སུ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པའི་ནང་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་ནས་
en: ‘By this root of virtue, may I become a protector for the world’s blind who are without a guide, without any guide at all, without anyone to show them the way—an arhat, a totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods, a blessed buddha.’

source: ཚིགས་སུ་བཅད་དེ་ སྨྲས་པ།
en: Then he spoke this verse:

source: སྦྱིན་པ་རྒྱ་ཆེར་གྱུར་པ་འདི་ཡིས་ནི། །སྲིད་གསུམ་སངས་རྒྱས་རང་བྱུང་གྱུར་པར་ཤོག །
en: “ ‘By this vast gift, may I become A self-arisen buddha in the triple world.

source: བརྒལ་ནས་སྔོན་གྱི་རྒྱལ་བའི་དབང་རྣམས་ཀྱིས། །སྐྱེ་བོ་ཕལ་ཆེན་མ་བསྒྲལ་རྣམས་ཀྱང་བསྒྲལ། །ཞེས་སྨྲས་ནས།
en: And when I do, may I liberate those not freed By the mighty victors who came before me.’

source: ཁམ་དེ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྲམ་ཟེའི་ཆ་ལུགས་ཅན་ལ་བྱིན་ནོ། །
en: “With that, he handed the morsel to Śakra, King of the Gods, who was in the guise of a brahmin.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་མཆོག་ཏུ་དཀའ་བ་བྱས་སོ་སྙམ་དུ་བསམས་ཏེ།
en: ‘This bodhisattva has performed a magnificent austerity.’

source: བྲམ་ཟེའི་ཆ་ལུགས་མི་སྣང་བར་བྱས་ནས་རང་བཞིན་གྱི་ལུས་སུ་བསྒྱུར་ཏེ་སྨྲས་པ།
en: His brahmin guise disappeared and he assumed his natural form and asked,

source: ཁྱོད་འབད་པ་འདིས་ཅི་ཞིག་སྒྲུབ། དེས་སྨྲས་པ།
en: ‘What will you accomplish by these efforts?’

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་བོ། །
en: “ ‘I shall attain unexcelled, total, and complete enlightenment,’ was his reply.

source: བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: “Śakra said,

source: ཁྱོད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བ་རྣམས་དེ་འདྲ་བ་ལས་ན། ཁྱོད་ནི་ངེས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་གྱིས་དེའི་ཚེ་བདག་དྲན་པར་མཛོད་ཅིག་ཅེས་སྨྲས་ནས
en: ‘With a mind and mental states like these, you are certain to fully awaken to unexcelled, total, and complete enlightenment. When you do, please remember me.’

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་དབང་ཆེན་གྱི་ཆར་ཕབ་སྟེ།
en: With that, Śakra, King of the Gods, let fall a mighty downpour of rain.

source: དེའི་ཚེ་འབྲུ་ཐམས་ཅད་རྒྱལ་ནས་ལོ་ལེགས་པར་གྱུར་ཏེ་ཀཱ་ཤིའི་ཡུལ་སྔ་མཁོ་བཞིན་དུ་གྱུར་ཏོ། །
en: All the grains began to sprout into a great harvest, and Kāśi was restored.

source: དེའི་ཚེ་རྒྱལ་པོ་ཟླ་འོད་ཅེས་བྱ་བར་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ཏེ།
en: I am the one who was King Candraprabha then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་ཡང་ང་སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའི་བསྔགས་པ་བརྗོད་པར་གྱུར་ན།
en: At that time I also commended giving and the portion given.

source: ང་ད་ལྟར་སྦྱིན་པ་དང་སྦྱིན་པའི་འབྲས་བུ་མངོན་སུམ་དུ་མཐོང་བར་གྱུར་པའི་ཚེ་ལྟ་ཅི་སྨོས་ཏེ། དེ་བཞིན་གཤེགས་པ་ད་ལྟར་སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའི་བསྔགས་པ་བརྗོད་པར་ཅི་སྟེ་མི་མཛད།
en: Why then, having manifested the fruits of giving, would the Tathāgata now not commend giving and the portion given?”

source: ལས་བརྒྱ་ཐམ་པ་ལས་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་གསུམ་པ་རྫོགས་སྷོ།། །།
en: This concludes Part Three of The Hundred Deeds.

source: སྡོམ་ནི། བྱམས་པའི་སྟོབས་དང་རླུང་ནག་དང་། །གྲོག་མ་གཉིས་དང་སྤྱོད་ཡུལ་དང་། །དགོན་པ་གླང་ཀླུ་སེང་གེ་དང་། །དབྱེན་དང་ནགས་ཁུང་ཐོས་པ་རྣམས། །
en: 1. The Story of Maitrībala 2. The Dark Storm 3. Ants: Two Stories 4. The Lay of the Land 5. The Story of Āraṇyaka 6. The Elephant 7. The Nāga (1) 8. The Story of Siṃha 9. The Schism in the Saṅgha 10. The Dark Forest 11. The One Who Heard

source: བྱམས་པའི་སྟོབས་ཞེས་བྱ་བ་ནི།
en: The Story of Maitrībala

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་མདོ་དབྱིག་དགའི་རྟོགས་པ་བརྗོད་པ་ལས། གཏན་ཚིགས་ཇི་སྐད་འབྱུང་བ་བཞིན་དུ་རྒྱས་པར་སྦྱར་ཏེ།
en: When the Blessed One was in Śrāvastī, the following took place—providing a statement additional to the life story of Wealth’s Delight in explaining how the events of The Sūtra of the Setting in Motion of the Wheel of Dharma came about.

source: དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: The monks requested him,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ལྔ་སྡེ་རྣམས་དམ་པའི་ཆོས་ཀྱི་བཅུད་ཀྱིས་ཚིམ་པར་མཛད་ནས་གཡུང་དྲུང་གི་མཐར་ཐུག་པ། གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཀོད་པ་ལ་གཟིགས་ལགས།
en: “Lord, tell us why the Blessed One sated the group of five monks with a taste of the holy Dharma, establishing them in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེའདས་པའི་དུས་ན་ཡང་ངས་འདི་རྣམས་རང་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱས་ནས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཇི་ལྟར་བཀོད་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, I sated them with my own flesh and blood, and set them on the path of the ten virtuous actions. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་རྒྱལ་པོ་བྱམས་པའི་སྟོབས་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times past a king named Maitrībala reigned in the city of Vārāṇasī.

source: དེའི་རིང་ལ་འབྱོར་པ་དང་རྒྱས་པ་དང་བདེ་བ་དང་ལོ་ལེགས་པ་དང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་དང་རྩོད་པ་དང་འཐབ་པ་ཞི་བ་དང་འཁྲུག་པ་དང་ནང་འཁྲུག་པ་དང་ཆོམ་རྐུན་དང་ནད་དང་མུ་གེ་མེད་པ་དང་འབྲས་སཱ་ལུ་དང་བུ་རམ་ཤིང་དང་བ་ལང་དང་མ་ཧེ་དང་ལྡན་པར་འདུག་སྟེ
en: During his reign, the kingdom was prosperous, flourishing, happy, and well populated. The harvest was good. Quarreling and arguments had ceased, there was no fighting or infighting, and there were no robbers, thieves, illness, or famine. Rice, sugarcane, cattle, and buffalo were plentiful.

source: རྒྱལ་པོ་དེ་ཡང་བྱམས་པའི་བདག་ཉིད་ཅན། སྙིང་རྗེ་ཆེ་བ། སེམས་ཅན་ལ་བྱམས་པ། སྦྱིན་པ་ལ་དགའ་བ་ཞིག་སྟེ།
en: “This king was the epitome of love, was extremely compassionate, loved beings, and delighted in giving.

source: དགེ་སྦྱོང་དང་བྲམ་ཟེ་དང་བཀྲེན་པ་དང་སྡུག་ཅིང་ཕོངས་པ་དང་སློང་བ་རྣམས་ཚིམ་པར་བྱེད་ལ།
en: He provided for the ascetics, the brahmins, the indigent, the bereft, and the poor.

source: བཟའ་བ་དང་བཅའ་བ་མང་པོ་བཤམས་ནས། སྲོག་ཆགས་ནམ་མཁའ་ལ་གནས་པ་དང་ཆུ་ན་གནས་པ་དང་སྐམ་ན་གནས་པ་རྣམས་ལ་སྦྱིན་པར་བྱེད་དོ། །
en: He prepared a great deal of food and drink and made gifts of it to the creatures who flew through the sky, dwelt in the water, or made their homes in the fields.

source: ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་ལ་བྱམས་པ་སྒོམ་པར་བྱེད་དོ། །
en: He cultivated love for the people of his country.

source: དེས་དེའི་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ལ་བྱམས་པའི་སེམས་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ་འདུག་ནས། དེའི་མཐུས་སེམས་ཅན་དེ་དག་ལ་སུ་ཡང་གནོད་པ་ཅུང་ཟད་ཀྱང་བྱེད་མི་ནུས་སོ། །
en: The minds of all the people of his country were filled with love, and due to its power no one could do them any harm.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུའི་བཙོན་ར་ནས། གཟི་བྱིན་འཕྲོག་པའི་གནོད་སྦྱིན་ལྔ་བྲོས་ཏེ།
en: “One day, five life-draining yakṣas absconded from the prison of King Vaiśravaṇa .

source: སྐྱེ་བོ་མང་པོའི་གཟི་བྱིན་འཕྲོག་པར་བྱེད་ཅིང་བཱ་རཱ་ཎ་སཱིར་འོངས་ཏེ་དེར་ཕྱིན་ནས།
en: Draining the life out of many people, they made their way to Vārāṇasī,

source: ཡམས་ཀྱི་ནད་བཏང་བ་ལས་དེ་དག་གིས་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ཡན་ཆད་སུའི་གཟི་བྱིན་ཡང་དབྲོག་པར་མ་ནུས་ནས།
en: but as they introduced their pestilence there, they were unable to drain even the least bit of life from any being, not even the animals.

source: དེ་དག་གིས་བསམས་པ།
en: They wondered,

source: གང་གིས་ཡུལ་འདིར་བདག་ཅག་གིས་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ཡན་ཆད་སུའི་གཟི་བྱིན་ཡང་དབྲོག་པར་མ་ནུས་པ་འདི་སུའི་མཐུ་ཡིན་པ་ཇེ་དྲི་བར་བྱའོ་སྙམ་ནས་
en: ‘Why is it that in this country we are unable to drain even the least bit of life from any being, even the animals? We should ask whose great power this is.’

source: བ་ལང་རྫི་དང་ཕྱུགས་རྫི་རྣམས་ལ་དྲིས་པ།
en: They asked the shepherds and the other animal herders,

source: ཀྱེ་གང་གི་ཡུལ་འདིར་སུ་ལ་ཡང་གནོད་པ་ཅུང་ཟད་ཀྱང་བྱེད་མི་ནུས་པ་འདི་སུའི་མཐུ་ཡིན།
en: ‘Why is it that we cannot harm anyone in this land in the least? Whose power is causing this?’

source: དེ་དག་གིས་སྨྲས་པ། རྒྱལ་པོ་འདི་བྱམས་པའི་བདག་ཉིད་ཅན་ཡིན་ཏེ།
en: “ ‘Our king is the epitome of love,’ they replied.

source: དེས་ཡུལ་ན་གནས་པའི་སྐྱེ་བོ་མང་པོ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ལ་བྱམས་པའི་སེམས་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ་འདུག་པ་དེའི་མཐུས་ན།
en: ‘The minds of all the people of his country are filled with so much love that no one can do them any harm.

source: ཡུལ་འདིར་སུས་ཀྱང་གནོད་པ་ཅུང་ཟད་ཀྱང་བྱེད་མི་ནུས་སོ། །
en: Because of him, in this land no one can do us even the least bit of harm.’

source: གནོད་སྦྱིན་རྣམས་ཀྱིས་བསམས་པ། རྒྱལ་པོ་དེ་ནི་བསོད་ནམས་ཅན་ཆེ་བར་གྲགས་པ།
en: “ ‘This king is a person of merit,’ the yakṣas thought.

source: བྱམས་པའི་བདག་ཉིད་ཅན། སྙིང་རྗེ་ཆེ་བ། སེམས་ཅན་ལ་བྱམས་པ་ཞིག་སྟེ།
en: ‘He’s well known as the epitome of love and for being quite compassionate, with a love for beings.

source: དེས་ནི་བདག་ཅག་འགྲངས་པར་བྱེད་ནུས་གོར་མ་ཆག་སྙམ་ནས།
en: He’ll surely be able to fill our stomachs!’

source: བྲམ་ཟེའི་ཆ་ལུགས་སུ་བསྒྱུར་ཏེ་བྱམས་པའི་སྟོབས་ཀྱི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: So they transformed their appearances into those of brahmins, approached King Maitrībala, and said,
